Junglyfly/SYSU-EEG-BCI/02 - source_code/EEF_STM32_code/EEGads1299/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Board_Led_Pin GPIO_PIN_3
#define Board_Led_GPIO_Port GPIOE
#define Board_KEY_Pin GPIO_PIN_13
#define Board_KEY_GPIO_Port GPIOC
#define Ads_1_START_Pin GPIO_PIN_0
#define Ads_1_START_GPIO_Port GPIOC
#define Ads_1_SPI2_MOSI_Pin GPIO_PIN_1
#define Ads_1_SPI2_MOSI_GPIO_Port GPIOC
#define Ads_1_SPI2_MISO_Pin GPIO_PIN_2
#define Ads_1_SPI2_MISO_GPIO_Port GPIOC
#define Ads_1_SPI_CS_Pin GPIO_PIN_3
#define Ads_1_SPI_CS_GPIO_Port GPIOC
#define Ads_1_DRDY_Pin GPIO_PIN_0
#define Ads_1_DRDY_GPIO_Port GPIOA
#define Ads_1_DRDY_EXTI_IRQn EXTI0_IRQn
#define Ads_1_RESET_Pin GPIO_PIN_1
#define Ads_1_RESET_GPIO_Port GPIOA
#define Ads_1_PWDN_Pin GPIO_PIN_2
#define Ads_1_PWDN_GPIO_Port GPIOA
#define Ads_2_SPI6_CS_Pin GPIO_PIN_4
#define Ads_2_SPI6_CS_GPIO_Port GPIOA
#define Ads_2_SPI6_SCK_Pin GPIO_PIN_5
#define Ads_2_SPI6_SCK_GPIO_Port GPIOA
#define Ads_2_SPI6_MISO_Pin GPIO_PIN_6
#define Ads_2_SPI6_MISO_GPIO_Port GPIOA
#define Ads_2_SPI6_MOSI_Pin GPIO_PIN_7
#define Ads_2_SPI6_MOSI_GPIO_Port GPIOA
#define Ads_1_SPI2_SCK_Pin GPIO_PIN_10
#define Ads_1_SPI2_SCK_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
